am/OpenFOAM-10/tutorials/multiphase/multiphaseEulerFoam/RAS/Grossetete/constant/physicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   18.015;
    }
    equationOfState
    {
        rho         995.7;
    }
    thermodynamics
    {
        Cv          4180;
        Hf          0;
    }
    transport
    {
        mu          7.99e-04;
        Pr          2.289;
    }
}
// ************************************************************************* //
